Documents/БольшаяЯчеистаяСборка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>БольшаяЯчеистаяСборка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвижениеТары</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТарыПоШК</xr:Item>
				<xr:Item>AccumulationRegister.ЗонаОтгрузки</xr:Item>
				<xr:Item>InformationRegister.РегТарыПоШК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВКомплект</Name>
					<Comment>Данный Документ входит в комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументСписания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СписаниеТовараСЗоныОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоКоробокПриПроверке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектБЯС</Name>
					<Comment>Документ комплект в котый входит данная сборка</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коробки</Name>
					<Comment>Количество коробок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направление</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПоказыватьВСписке</Name>
					<Comment>Не показывать в списке НЕ РАСПРЕДЕЛЕННЫХ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийОбъем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПогрузкаВАвто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогрузкаТоваровВАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПутевойЛист_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшивкиРаспечатанны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реестр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатыРаспечатаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСборки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостояниеСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списан</Name>
					<Comment>Списание товара с зоны отгрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокМестХранений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКомплект</Name>
					<Comment>Данный Документ Является комплектом сборок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолТара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратВодителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыРасхода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Док</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолПозиций</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АдресаДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МестаОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКоробок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыКомплекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокБЯС</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БольшаяЯчеистаяСборка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СостояниеСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СостояниеСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Коприходованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БольшаяЯчеистаяСборка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если РольДоступнаРазработчик() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				
		
		Для Каждого ТекСтрока Из Объект.ДокументыРасхода Цикл
			Если Не ТекСтрока.Проверен Тогда
				Отказ = Истина;
				ОчиститьСообщения();
				Сообщить("Проверьте все счет-фактуры");
			КонецЕсли;
		КонецЦикла;
		
		Если Объект.МестаОтгрузки.Количество() = 0 Тогда
			Сообщить("Укажите места отгрузки");
		Иначе
			Если Не Объект.МестаОтгрузки.Итог("КоличествоКоробок") = Объект.Коробки Тогда
				Сообщить("Количество коробок к распределению на места отгрузки должно быть равно общему количеству коробок");
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда
			Объект.СписокМестХранений = "";
			
			Для Каждого ТекСтрока Из Объект.ДокументыРасхода Цикл
				Если ЗначениеЗаполнено(ТекСтрока.Комментарий) Тогда
					Объект.Комментарий = Объект.Комментарий + ТекСтрока.СчетФ + " " + ТекСтрока.Комментарий + " ;";
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого ТекСтрока Из Объект.МестаОтгрузки Цикл
				Объект.СписокМестХранений = Объект.СписокМестХранений + " " + ТекСтрока.МестоОтгрузки;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РольДоступнаРазработчик()
	Возврат РольДоступна("Разработчик");
КонецФункции // РольДоступна()


&НаКлиенте
Процедура ПроверитьСчетФактуры(Команда)
	Для Каждого ТекСтрока Из Объект.ДокументыРасхода Цикл
		ТекСтрока.Проверен = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если НЕ ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник = "СканерШтрихкода" И Событие = "Barcode" И ЗначениеЗаполнено(Данные) Тогда
		//Если СтрДлина(Данные) = 12 Тогда	
		//	НайденныеСтроки = Объект.ДокументыРасхода.НайтиСтроки(Новый Структура("ШК", Данные));
		//	Если Не НайденныеСтроки.Количество() = 0 Тогда
		//		НайденныеСтроки[0].Проверен = Истина
		//	Иначе
		//		Сообщить("Не найдена счет-фактура №" + Данные);
		//	КонецЕсли;
		//КонецЕсли;
		//Ищем строку с пустым ШК
		НайденныеСтроки=Объект.ДокументыРасхода.НайтиСтроки(Новый Структура("ШК",""));
		Если НайденныеСтроки.Количество()>0 Тогда
		ШК=Лев(Данные,12);
		НайденныеСтроки[0].ШК=ШК;
		Сообщить("Установлен ШК-"+ШК+" для СФ-"+НайденныеСтроки[0].СчетФ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрктуруНаСервере()
	
	Массив = Новый Массив(2);
	Массив.Добавить(1,2);	
	Возврат Массив;
КонецФункции


&НаКлиенте
Процедура МестаОтгрузкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Элемент.ТекущиеДанные.НомерСтроки = 1 И НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КоличествоКоробок = Объект.Коробки;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура МестаОтгрузкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Отказ = Ложь;
	НайденныеСтроки = Объект.МестаОтгрузки.НайтиСтроки(Новый Структура("МестоОтгрузки", Элемент.ТекущиеДанные.МестоОтгрузки));
	Если НайденныеСтроки.Количество() > 1 Тогда
		Сообщить("Место отгрузки " + Элемент.ТекущиеДанные.МестоОтгрузки + " уже указано");
		Элемент.ТекущиеДанные.МестоОтгрузки = "";
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если Объект.МестаОтгрузки.Итог("КоличествоКоробок") > Объект.Коробки Тогда
			Элемент.ТекущиеДанные.КоличествоКоробок = "";
			Сообщить("Количество коробок к распределению на места отгрузки превышает общее количество коробок");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Отказ Тогда
		Объект.СостояниеСборки	= Перечисления.СостояниеСборки.КОтгрузке;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МестаОтгрузкиМестоОтгрузкиПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.МестаОтгрузки.ТекущиеДанные;
	//
	//Отказ = ПолучитьКоличествоМестОтгрузки(ТекущиеДанные.МестоОтгрузки);
	//
	//Если Отказ Тогда
	//	ТекущиеДанные.МестоОтгрузки = "";
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоМестОтгрузки(МестоОтгрузки)
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	ТоварыНаСкладахОстатки.ДокументПрихода КАК ДокументПрихода
	//|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	//|			,
	//|			НомерМестаОтгрузки = &МестоОтгрузки
	//|				И НЕ ДокументПрихода = &ДокументПрихода) КАК ТоварыНаСкладахОстатки";
	//Запрос.УстановитьПараметр("МестоОтгрузки",		МестоОтгрузки);
	//Запрос.УстановитьПараметр("ДокументПрихода",	Объект.Ссылка);
	//ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	//КоличествоМест = ТаблицаДокументов.Количество();
	//
	//НайденныеСтроки = Объект.МестаОтгрузки.НайтиСтроки(Новый Структура("МестоОтгрузки", МестоОтгрузки));
	//Если Не НайденныеСтроки.Количество() = 0 Тогда
	//	КоличествоМест = КоличествоМест + НайденныеСтроки.Количество();	
	//КонецЕсли;
	//
	//Если КоличествоМест > Константы.КоличествоПоддонов.Получить() Тогда
	//	Сообщить("Данное место отгрузки занято");
	//	Возврат Истина;
	//Иначе
	//	Возврат Ложь
	//КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьШК(Команда)
ПолучитьШКСервер();	
  ЭтаФорма.Модифицированность=Истина;
КонецПроцедуры


&НаСервере

Процедура ПолучитьШКСервер()
	//Проверка на ШК
Для Каждого Стр из Объект.ДокументыРасхода Цикл
	
	//Если СокрЛП(Стр.ШК)="" Тогда
		//ПолучитШК  Дельфи	
		//Стр.ШК=модСерверПолныеПрава.ПолучитьШК_Дельфи(СокрЛП(Стр.СчетФ),Объект.Организация);
		Стр.ШК=модСерверПолныеПрава.ПолучитьШК_ДельфиПоНомеруРасходногоОрдера(СокрЛП(Стр.ДокНомер),СокрЛП(Объект.Организация));

	//КонецЕсли;	
	
		
КонецЦикла;
//Если  ВнешниеИсточникиДанных.SRVGLOB.ПолучитьСостояние()=СостояниеВнешнегоИсточникаДанных.Подключен Тогда
//	ВнешниеИсточникиДанных.SRVGLOB.РазорватьСоединение();
//	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазобратьКомплект(Команда)
	РазобратьКомплектСЕРВЕР();
КонецПроцедуры

&НаСервере
Процедура РазобратьКомплектСЕРВЕР()
	//Ищем БЯС
	НачатьТранзакцию();
	Для Каждого стр_ДокументыКомплекта Из Объект.ДокументыКомплекта Цикл
		док_БЯС=стр_ДокументыКомплекта.ДокБЯС.ПолучитьОбъект();
		док_БЯС.ВходитВКомплект =Ложь;
		док_БЯС.КомплектБЯС ="";
		док_БЯС.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	Объект.ДокументыРасхода.Очистить();
	Объект.МестаОтгрузки.Очистить();
	//Объект.ДокументыКомплекта.Очистить();
	Объект.ЭтоКомплект=Ложь;
	Объект.Коробки=0;
	
	ЗафиксироватьТранзакцию();
	Сообщить("ДокументыКомплекта очистите вручную");	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументРОпоШКсДЕЛЬФИ(Команда)
	
	струкРезультат=модСерверПолныеПрава.ПолучитьДокументРО_ДельфиПоШК_Вариант2(Элементы.ДокументыРасхода.ТекущиеДанные.ШК);
	
	Если струкРезультат.Результат="Ошибка" Тогда
		Сообщить(струкРезультат.РезультатТекст);
	КонецЕсли;
	
	Если струкРезультат.Результат="Найден" Тогда
		Сообщить(струкРезультат.РезультатТекст);
		 Элементы.ДокументыРасхода.ТекущиеДанные.Док=струкРезультат.РезультатТекст;
		 Элементы.ДокументыРасхода.ТекущиеДанные.ДокНомер=струкРезультат.НомерРО;
		 Элементы.ДокументыРасхода.ТекущиеДанные.СчетФ=струкРезультат.НомерСчетФ;
		 Элементы.ДокументыРасхода.ТекущиеДанные.ДатаДокумента=струкРезультат.ДатаДокумента;
		 Элементы.ДокументыРасхода.ТекущиеДанные.Комментарий=струкРезультат.Комментарий;
         Элементы.ДокументыРасхода.ТекущиеДанные.Количество=струкРезультат.КоличествоИтог;
		 Элементы.ДокументыРасхода.ТекущиеДанные.КолПозиций=струкРезультат.КоличествоПозиций;
		 Элементы.ДокументыРасхода.ТекущиеДанные.Сумма=струкРезультат.СуммаПоДокументу;
		 
		 ЭтаФорма.Модифицированность=Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИсториюШК(Команда)
	НомерСФ=Элементы.ДокументыРасхода.ТекущиеДанные.СчетФ;
	ДатаСФ=Элементы.ДокументыРасхода.ТекущиеДанные.ДатаДокумента;
	Организация=Объект.Организация;
	
	Если Найти(НомерСФ,"опт")>0 Тогда
		Организация="НФС_ОПТ";
	КонецЕсли;
	Если Найти(НомерСФ,"апт")>0 Тогда
		Организация="НФС_АПТ";
	КонецЕсли;
	Если Организация="Асклепий" Тогда
		Организация="АСК";
	КонецЕсли;
	
	
	
	НомерСФ=СтрЗаменить(НомерСФ,"(опт)","");
	НомерСФ=СтрЗаменить(НомерСФ,"(апт)","");
	
	П=Новый Структура;
	П.Вставить("НомерСФ",НомерСФ);
	П.Вставить("ДатаСФ",ДатаСФ);
	П.Вставить("Организация",Организация);
	ОткрытьФорму("Обработка.ИсторияШКпоНомеруСФиДате.Форма.Форма",П);
	
	

КонецПроцедуры
